#include <stdio.h>

#include "ui.h"

void menu()
{
    printf("--- МЕНЮ ---\n");
    printf("Выберите команду:\n");
    printf("1: Добавить строку в BST дерево\n");
    printf("2: Добавить узел в BST дерево\n");
    printf("3: Удалить узел из BST дереве\n");
    printf("4: Вывести BST дерево\n");
    printf("5: Вывести узел BST дерева\n");
    printf("6: Удалить повторяющиеся буквы и сбалансировать\n");
    printf("\n");
    printf("7: Добавить строку в AVL дерево\n");
    printf("8: Добавить узел в AVL дерево\n");
    printf("9: Удалить узел из AVL дереве\n");
    printf("10: Вывести AVL дерево\n");
    printf("11: Вывести узел AVL дерева\n");
    printf("\n");
    printf("12: Добавить строку в хэш-таблицу\n");
    printf("13: Добавить символ в хэш-таблицу\n");
    printf("14: Удалить символ из хэш-таблицы\n");
    printf("15: Вывести хэш-таблицу\n");
    printf("16: Вывести символ из хэш-таблицы\n");
    printf("\n");
    printf("17: Сравнить эффективность поиска в различных структурах\n");
    printf("18: Очистить BST дерево\n");
    printf("19: Очистить AVL дерево\n");
    printf("20: Очистить хэш-таблицу\n");
    printf("21: Вывести меню\n");
    printf("0: Выход\n");
}